ka2_2024/src/Enums/СпособыОпределенияСтоимостиПредметовАренды/СпособыОпределенияСтоимостиПредметовАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОпределенияСтоимостиПредметовАренды</name>
  <enumValues>
    <name>Дисконтирование</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>ПоСуммеДоговора</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ДоговорыАренды/ДоговорыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАренды</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерДоговора</name>
    <type>
      <types>EnumRef.ХарактерыДоговоровФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Балансодержатель</name>
    <type>
      <types>EnumRef.БалансодержательПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОбеспечительныйПлатеж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВыкупПредметовАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАвансированиеВыкупнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияСтоимостиАктивов</name>
    <type>
      <types>EnumRef.СпособыОпределенияСтоимостиПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовУслуги</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовУслуги</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеУслуги</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовПроценты</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовПроценты</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПроценты</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОформлениеЗаявленийОВвозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетАвансовПоТекущимАренднымПлатежамВРазрезеПлатежныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйНомерВалютногоКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/CommonModules/УчетАрендованныхОСКлиент/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Открывает форму для ввод срока аренды, после ввода устанавливает срок в объекте.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма.
// 	Объект - ДанныеФормыСтруктура - Объект.
// 	ОбработчикЗавершения - Неопределено - Обработчик формы, который нужно вызвать после ввода срока.
Процедура ВвестиСрокАренды(Форма, Объект, ОбработчикЗавершения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНачалаАренды", Объект.ДатаНачалаАренды);
	ПараметрыФормы.Вставить("СрокЛет", Объект.СрокЛет);
	ПараметрыФормы.Вставить("СрокМес", Объект.СрокМес);
	ПараметрыФормы.Вставить("СрокДней", Объект.СрокДней);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	
	ОткрытьФорму("Справочник.ДоговорыАренды.Форма.ВводСрокаАренды",
			ПараметрыФормы,,,,, 
			Новый ОписаниеОповещения("ВвестиСрокАрендыЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ВвестиСрокАрендыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено 
		ИЛИ ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ДополнительныеПараметры.Объект;
	
	Если Объект.ДатаНачалаАренды <> РезультатЗакрытия.ДатаНачалаАренды
		ИЛИ Объект.СрокЛет <> РезультатЗакрытия.СрокЛет
		ИЛИ Объект.СрокМес <> РезультатЗакрытия.СрокМес
		ИЛИ Объект.СрокДней <> РезультатЗакрытия.СрокДней Тогда
			
		ДополнительныеПараметры.Форма.СрокАрендыИзменен = Истина;
		
		Объект.ДатаНачалаАренды = РезультатЗакрытия.ДатаНачалаАренды;
		Объект.СрокЛет = РезультатЗакрытия.СрокЛет;
		Объект.СрокМес = РезультатЗакрытия.СрокМес;
		Объект.СрокДней = РезультатЗакрытия.СрокДней;
		
		ДополнительныеПараметры.Форма.Модифицированность = Истина;
		
		Если ДополнительныеПараметры.ОбработчикЗавершения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработчикЗавершения, РезультатЗакрытия);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

// Проверяет возможность заполнения графика оплат и начислений по данным раздела "Расчеты"
// 
// Параметры:
// 	Объект - ДокументОбъект.ЗаключениеДоговораАренды, ДокументОбъект.ИзменениеУсловийДоговораАренды -
//  РеквизитыДоговора - Структура -
//  
// Возвращаемое значение:
// 	Булево - Истина, если можно заполнить
Функция ПроверитьВозможностьЗаполненияГрафикаПоРасчетам(Объект, РеквизитыДоговора) Экспорт
	
	ОчиститьСообщения();
	
	ЕстьОшибки = Ложь;
	
	ДатаОкончания = ВнеоборотныеАктивыКлиентСервер.ДатаОкончанияПоСроку(
						Объект.ДатаНачалаАренды, Объект.СрокЛет, Объект.СрокМес, Объект.СрокДней, Истина);
	
	ЭтоИзменениеУсловийАренды = УчетАрендованныхОСКлиентСервер.ЭтоИзменениеУсловийАренды(Объект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Договор"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Договор", "Объект", ЕстьОшибки);
	КонецЕсли;
	
	//
	Если РеквизитыДоговора.ЕстьОбеспечительныйПлатеж
		И НЕ ЭтоИзменениеУсловийАренды		
		И НЕ ЗначениеЗаполнено(Объект.СуммаОбеспечительногоПлатежа) Тогда
			
		ТекстСообщения = НСтр("ru = 'Поле ""Сумма обеспечительного платежа"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СуммаОбеспечительногоПлатежа", "Объект", ЕстьОшибки);
	КонецЕсли;

	Если РеквизитыДоговора.ЕстьОбеспечительныйПлатеж
		И НЕ ЗначениеЗаполнено(Объект.ДатаПервогоОбеспечительногоПлатежа) Тогда
			
		ТекстСообщения = НСтр("ru = 'Поле ""Дата первого обеспечительного платежа"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаПервогоОбеспечительногоПлатежа", "Объект", ЕстьОшибки);
	КонецЕсли;

	//
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПервогоПлатежа)
		И Объект.ПериодичностьОплат <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная")
		И ЗначениеЗаполнено(Объект.ПериодичностьОплат) Тогда
			
		ТекстСообщения = НСтр("ru = 'Поле ""Дата первого платежа за услуги по аренде"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаПервогоПлатежа", "Объект", ЕстьОшибки);
	КонецЕсли;

	//
	Если Объект.ДатаНачалаАренды = '000101010000'
		ИЛИ Объект.СрокЛет = 0 И Объект.СрокМес = 0 И Объект.СрокДней = 0 Тогда
			
		ТекстСообщения = НСтр("ru = 'Поле ""Срок аренды"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СрокАренды", , ЕстьОшибки);
	КонецЕсли;

	//
	Если Объект.ПериодичностьОплат <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная")
		И ЗначениеЗаполнено(Объект.ПериодичностьОплат)
		И НЕ ЗначениеЗаполнено(Объект.ОплатаУслугиПоАренде) Тогда
			
		ТекстСообщения = НСтр("ru = 'Поле ""Платеж за услуги по аренде"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ОплатаУслугиПоАренде", "Объект", ЕстьОшибки);
	КонецЕсли;

	Если Объект.ПериодичностьНачислений <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная")
		И ЗначениеЗаполнено(Объект.ПериодичностьНачислений)
		И НЕ ЗначениеЗаполнено(Объект.НачислениеУслугиПоАренде) Тогда
			
		ТекстСообщения = НСтр("ru = 'Поле ""Начисление услуги по аренде"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "НачислениеУслугиПоАренде", "Объект", ЕстьОшибки);
	КонецЕсли;

	//
	Если РеквизитыДоговора.ЕстьОбеспечительныйПлатеж
		И Объект.ДатаПервогоОбеспечительногоПлатежа > ДатаОкончания
		И Объект.ДатаПервогоОбеспечительногоПлатежа <> '000101010000'
		И ДатаОкончания <> '000101010000' Тогда
			
		ТекстСообщения = НСтр("ru = 'Обеспечительный платеж должен быть не позже окончания срока аренды'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаПервогоОбеспечительногоПлатежа", "Объект", ЕстьОшибки);
	КонецЕсли;

	//
	Если Объект.ДатаПервогоПлатежа < Объект.ДатаНачалаАренды
		И Объект.ДатаПервогоПлатежа <> '000101010000'
		И Объект.ДатаНачалаАренды <> '000101010000' Тогда
			
		ТекстСообщения = НСтр("ru = 'Первый платеж должен быть не раньше даты начала аренды'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаПервогоПлатежа", "Объект", ЕстьОшибки);
	КонецЕсли;

	Возврат НЕ ЕстьОшибки;
	
КонецФункции

// Проверяет возможность расчета ставки или стоимости.
// 
// Параметры:
// 	Объект - ДокументОбъект.ЗаключениеДоговораАренды, ДокументОбъект.ИзменениеУсловийДоговораАренды, ДокументОбъект.ВводОстатковВзаиморасчетовПоАренде -
// 	РеквизитыДоговора - Структура -
// 	ИмяТабличнойЧастиОС - Строка -
// 	СообщатьОбОшибках - Булево -
// 	ПредыдущиеУсловия - Неопределено, Структура - См. УчетАрендованныхОС.СтоимостьПоПредыдущимУсловиям
// 	
// Возвращаемое значение:
// 	Булево - 
Функция МожноРассчитатьСтавкуИлиСтоимость(Объект, РеквизитыДоговора, ИмяТабличнойЧастиОС, СообщатьОбОшибках = Истина, ПредыдущиеУсловия = Неопределено) Экспорт
	
	ОчиститьСообщения();
	
	ЕстьОшибки = Ложь;
	
	ПоФактическойСтоимости = (РеквизитыДоговора.СпособОпределенияСтоимостиАктивов = ПредопределенноеЗначение("Перечисление.СпособыОпределенияСтоимостиПредметовАренды.Вручную"));
	
	СписокОшибок = Новый Массив;
	
	Если ПоФактическойСтоимости Тогда
		
		Если ИмяТабличнойЧастиОС <> "" Тогда
			
			Если Объект.ОС.Количество() = 0 Тогда
				ТекстСообщения = НСтр("ru = 'Необходимо заполнить список предметов аренды и их стоимость'");
				ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, "ОС", "Объект", ЕстьОшибки);
			КонецЕсли;
			
			Для Каждого ДанныеСтроки Из Объект.ОС Цикл
				
				Если РеквизитыДоговора.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоровАренды.Аренда")
					И ДанныеСтроки.СправедливаяСтоимость = 0 Тогда
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1 необходимо заполнить справедливую стоимость'"), Формат(ДанныеСтроки.НомерСтроки, "ЧГ=;"));
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", ДанныеСтроки.НомерСтроки, "СправедливаяСтоимость");
					ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, Поле, "Объект", ЕстьОшибки);
					
				ИначеЕсли РеквизитыДоговора.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоровАренды.Лизинг")
					И ДанныеСтроки.Стоимость = 0 Тогда
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1 необходимо заполнить стоимость'"), Формат(ДанныеСтроки.НомерСтроки, "ЧГ=;"));
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", ДанныеСтроки.НомерСтроки, "Стоимость");
					ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, Поле, "Объект", ЕстьОшибки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			
			Если РеквизитыДоговора.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоровАренды.Аренда")
				И Объект.СправедливаяСтоимость = 0 Тогда
				
				ТекстСообщения = НСтр("ru = 'Необходимо заполнить справедливую стоимость'");
				ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, "СправедливаяСтоимость", "Объект", ЕстьОшибки);
				
			ИначеЕсли РеквизитыДоговора.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоровАренды.Лизинг")
				И Объект.Стоимость = 0 Тогда
				
				ТекстСообщения = НСтр("ru = 'Необходимо заполнить стоимость'");
				ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, "Стоимость", "Объект", ЕстьОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ УчетАрендованныхОСКлиентСервер.ЭтоИзменениеУсловийАренды(Объект) Тогда
			ДатаНачалаАренды = Объект.ДатаНачалаАренды;
			СтоимостьПредметовАренды =
				УчетАрендованныхОСКлиентСервер.СтоимостьПредметовАренды(Объект, РеквизитыДоговора, ИмяТабличнойЧастиОС);
			ПриведеннаяСтоимость = УчетАрендованныхОСКлиентСервер.ПриведеннаяСтоимость(
				СтоимостьПредметовАренды,
				Объект.ГрафикОплатУслуг, 
				Объект.ДатаНачалаАренды);
		Иначе
			ДатаНачалаАренды = НачалоДня(Объект.Дата);
			КоэффициентРаспределения =
				УчетАрендованныхОСКлиентСервер.КоэффициентРаспределенияСтоимости(Объект.ОС, РеквизитыДоговора);
			
			СтоимостьДобавленныхПредметовАренды =
				УчетАрендованныхОСКлиентСервер.СтоимостьДобавленныхПредметовАренды(Объект.ОС);
			
			ПриведеннаяСтоимость = 
				ПредыдущиеУсловия.ПриведеннаяСтоимость
				* КоэффициентРаспределения
				+ СтоимостьДобавленныхПредметовАренды;
				
		КонецЕсли;
		
		ВсегоПлатежейБезНДС = УчетАрендованныхОСКлиентСервер.ВсегоПлатежейБезНДС(
									Объект.ГрафикОплатУслуг, ДатаНачалаАренды, Объект.СтавкаНДС);
		
		Если ПриведеннаяСтоимость > ВсегоПлатежейБезНДС И ВсегоПлатежейБезНДС > 0 Тогда
			 
			Объект.ПриведеннаяСтоимость = ПриведеннаяСтоимость;
			Объект.ПроцентнаяСтавка = 0;
			Объект.СуммаПроцентов = 0;
			
			Если НЕ УчетАрендованныхОСКлиентСервер.ЭтоИзменениеУсловийАренды(Объект) Тогда
				Если РеквизитыДоговора.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоровАренды.Лизинг") Тогда
					ТекстСообщения = НСтр("ru = 'Сумма вложений лизингодателя (%1) должна быть меньше суммы платежей без НДС (%2)'");
				Иначе
					ТекстСообщения = НСтр("ru = 'Стоимость предметов аренды (%1) должна быть меньше суммы платежей без НДС (%2)'");
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru = 'Приведенная стоимость (%1) должна быть меньше суммы будущих платежей без НДС (%2)'");
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(ПриведеннаяСтоимость, "ЧДЦ=2"), Формат(ВсегоПлатежейБезНДС, "ЧДЦ=2"));

			ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, "ПроцентнаяСтавка",, ЕстьОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ДатаПервогоПлатежа < Объект.ДатаНачалаАренды
		И Объект.ДатаПервогоПлатежа <> '000101010000'
		И Объект.ДатаНачалаАренды <> '000101010000' Тогда
			
		ТекстСообщения = НСтр("ru = 'Первый платеж должен быть не раньше даты начала аренды (%1)'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(Объект.ДатаНачалаАренды,"ДЛФ=D;"));
		
		ВнеоборотныеАктивыКлиентСервер.ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, "ДатаПервогоПлатежа", "Объект", ЕстьОшибки);
		
	КонецЕсли;
	
	ДатаУслугаПоАренде = '000101010000';
	ДатаВыкупнаяСтоимость = '000101010000';
	ДатаОбеспечительныйПлатеж = '000101010000';
	Для Каждого ИсходнаяСтрокаГрафика Из Объект.ГрафикОплатУслуг Цикл		
		
		Если ИсходнаяСтрокаГрафика.УслугаПоАренде <> 0 
			И ИсходнаяСтрокаГрафика.Дата <> '000101010000' Тогда
			ДатаУслугаПоАренде = ?(
				ДатаУслугаПоАренде <> '000101010000', 
				Мин(ДатаУслугаПоАренде, ИсходнаяСтрокаГрафика.Дата), 
				ИсходнаяСтрокаГрафика.Дата);
		КонецЕсли;
		
		Если ИсходнаяСтрокаГрафика.ВыкупнаяСтоимость <> 0 
			И ИсходнаяСтрокаГрафика.Дата <> '000101010000' Тогда
			ДатаВыкупнаяСтоимость = ?(
				ДатаВыкупнаяСтоимость <> '000101010000', 
				Мин(ДатаВыкупнаяСтоимость, ИсходнаяСтрокаГрафика.Дата), 
				ИсходнаяСтрокаГрафика.Дата);
		КонецЕсли;
		
		Если ИсходнаяСтрокаГрафика.ОбеспечительныйПлатеж <> 0 
			И ИсходнаяСтрокаГрафика.Дата <> '000101010000' Тогда
			ДатаОбеспечительныйПлатеж = ?(
				ДатаОбеспечительныйПлатеж <> '000101010000', 
				Мин(ДатаОбеспечительныйПлатеж, ИсходнаяСтрокаГрафика.Дата), 
				ИсходнаяСтрокаГрафика.Дата);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СообщатьОбОшибках Тогда
		Для Каждого ОписаниеОшибки Из СписокОшибок Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОписаниеОшибки.ТекстСообщения,, ОписаниеОшибки.Поле, ОписаниеОшибки.ПутьКДанным);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции

Процедура ОткрытьГрафикОплатИНачислений(Объект, Форма, АдресГрафиков, ОписаниеОповещения, ИмяГрафика) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяГрафика", ИмяГрафика);
	ПараметрыФормы.Вставить("Договор", Объект.Договор);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("СлужебныеПараметрыФормы", Форма.СлужебныеПараметрыФормы);
	ПараметрыФормы.Вставить("ПроцентнаяСтавка", Объект.ПроцентнаяСтавка);
	ПараметрыФормы.Вставить("СтавкаНДС", Объект.СтавкаНДС);
	ПараметрыФормы.Вставить("ДатаНачалаАренды", Объект.ДатаНачалаАренды);
	ПараметрыФормы.Вставить("СуммаВыкупаПредметовАренды", Объект.СуммаВыкупаПредметовАренды);
	ПараметрыФормы.Вставить("СуммаНДСВыкупаПредметовАренды", Объект.СуммаНДСВыкупаПредметовАренды);
	ПараметрыФормы.Вставить("ПриведеннаяСтоимость", Объект.ПриведеннаяСтоимость);
	ПараметрыФормы.Вставить("ВалютаДокументаПредставление", Форма.ВалютаДокументаПредставление);
	ПараметрыФормы.Вставить("ГрафикНачисленияПроцентовВведенВручную", Объект.ГрафикНачисленияПроцентовВведенВручную);
	ПараметрыФормы.Вставить("ГрафикиДоговора", АдресГрафиков);
	Если УчетАрендованныхОСКлиентСервер.ЭтоИзменениеУсловийАренды(Объект) Тогда
		ПараметрыФормы.Вставить("ДатаИзмененияАренды", НачалоДня(Объект.Дата));
	Иначе
		ПараметрыФормы.Вставить("ДатаИзмененияАренды", '00010101');
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ДоговорыАренды.Форма.ГрафикОплатИНачислений", ПараметрыФормы,,,,, ОписаниеОповещения);
	
КонецПроцедуры

Процедура ОткрытьГрафикиДоходнойАренды(Объект, Форма, ОсновноеСредство, АдресГрафиков, ОписаниеОповещения) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Арендатор", Объект.Арендатор);
	ПараметрыФормы.Вставить("Договор", Объект.Договор);
	ПараметрыФормы.Вставить("ОсновноеСредство", ОсновноеСредство);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("СлужебныеПараметрыФормы", Форма.СлужебныеПараметрыФормы);
	ПараметрыФормы.Вставить("ГрафикиДоговора", АдресГрафиков);
	ПараметрыФормы.Вставить("ДатаНачалаАренды", НачалоДня(Объект.Дата));
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("ОтображатьГрафикПроцентовИзРегистра", Форма.ОтображатьГрафикПроцентовИзРегистра);
	
	ОткрытьФорму("ОбщаяФорма.ГрафикиДоходнойАренды", ПараметрыФормы, Форма,,,, ОписаниеОповещения);
	
КонецПроцедуры

Процедура ОткрытьЗаполнениеГрафиковДоходнойАренды(Объект, Форма, ВыбранныеОС, АдресГрафиков, ОписаниеОповещения) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Арендатор", Объект.Арендатор);
	ПараметрыФормы.Вставить("Договор", Объект.Договор);
	ПараметрыФормы.Вставить("ВыбранныеОС", ВыбранныеОС);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("СлужебныеПараметрыФормы", Форма.СлужебныеПараметрыФормы);
	ПараметрыФормы.Вставить("ГрафикиДоговора", АдресГрафиков);
	ПараметрыФормы.Вставить("ДатаНачалаАренды", НачалоДня(Объект.Дата));
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("ОтображатьГрафикПроцентовИзРегистра", Форма.ОтображатьГрафикПроцентовИзРегистра);
	
	ОткрытьФорму("ОбщаяФорма.ЗаполнениеГрафиковДоходнойАренды", ПараметрыФормы, Форма,,,, ОписаниеОповещения);
	
КонецПроцедуры

// Формирует печатную форму Справки-расчета начисления процентов
//
// Параметры:
//  Форма - см. Документ.ПередачаОСВАренду2_4.Форма.ФормаДокумента
//
Процедура СправкаРасчетНачисленияПроцентов(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОчиститьСообщения();
	
	// Проверим документ перед печатью.
	
	МассивОшибок = Новый Массив;
	
	Если НЕ Объект.Проведен Тогда 
		МассивОшибок.Добавить(НСтр("ru = 'Документ не проведен'"));
	КонецЕсли;
	
	Если Объект.ОС.Количество() = 0 Тогда
		МассивОшибок.Добавить(НСтр("ru = 'В документе нет ни одного основного средства'"));
	КонецЕсли;
	
	Если Объект.ГрафикОплатУслуг.Количество() = 0 Тогда
		МассивОшибок.Добавить(НСтр("ru = 'Не заполнен график оплат'"));
	КонецЕсли;
	
	Если Объект.ГрафикНачисленияПроцентов.Количество() = 0 Тогда
		МассивОшибок.Добавить(НСтр("ru = 'Не заполнен график начисления процентов'"));
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		ТекстСообщения = СтрСоединить(МассивОшибок, Символы.ПС);
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Печатаем справки-расчеты по выделенным строкам.
	ДанныеДляПечати = Новый Массив;
	СтрокаДляСправки = Новый Структура;
	СтрокаДляСправки.Вставить("ОсновноеСредство", ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка"));
	СтрокаДляСправки.Вставить("СтавкаДоходности", 0);
	СтрокаДляСправки.Вставить("АвансовыеПлатежи", 0);
	СтрокаДляСправки.Вставить("ПриведеннаяСтоимость", 0);
	СтрокаДляСправки.Вставить("НГЛС", 0);
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ОС.ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.ОС.ДанныеСтроки(ВыделеннаяСтрока);
		
		ТекущаяСтрокаДляСправки = СтрокаДляСправки;
		ТекущаяСтрокаДляСправки.ОсновноеСредство     = ТекущиеДанные.ОсновноеСредство;
		ТекущаяСтрокаДляСправки.СтавкаДоходности     = ТекущиеДанные.СтавкаДоходности;
		ТекущаяСтрокаДляСправки.АвансовыеПлатежи     = 0;
		ТекущаяСтрокаДляСправки.ПриведеннаяСтоимость = ТекущиеДанные.ПриведеннаяСтоимость;
		ТекущаяСтрокаДляСправки.НГЛС                 = ТекущиеДанные.НГЛС;
		
		ДанныеДляПечати.Добавить(ТекущаяСтрокаДляСправки);
		
	КонецЦикла;
	
	ИмяМакета = "СправкаРасчетНачисленияПроцентов";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеДляПечати",ДанныеДляПечати);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
					"Обработка.ПечатьСправкиРасчетаНачисленияПроцентов",
					ИмяМакета,
					Объект.Ссылка,
					ЭтотОбъект,
					ПараметрыПечати);
					
КонецПроцедуры

// Удаляет основное средство из графиков документа
//
// Параметры:
//  Объект - см. Документ.ПередачаОСВАренду2_4
//  ОсновноеСредство - СправочникСсылка.ОбъектыЭксплуатации
//
Процедура УдалитьОСИзГрафиков(Объект, ОсновноеСредство) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОсновноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикОплат = Объект.ГрафикОплатУслуг;
	ГрафикНачислений = Объект.ГрафикНачисленияУслуг;
	ГрафикПроцентов = Объект.ГрафикНачисленияПроцентов;
	
	СтруктураОтбора = Новый Структура("ОсновноеСредство", ОсновноеСредство);
	
	СтрокиОплат = ГрафикОплат.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаОплаты Из СтрокиОплат Цикл
		ГрафикОплат.Удалить(СтрокаОплаты);
	КонецЦикла;
	
	СтрокиНачислений = ГрафикНачислений.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаНачислений Из СтрокиНачислений Цикл
		ГрафикНачислений.Удалить(СтрокаНачислений);
	КонецЦикла;
	
	СтрокиПроцентов = ГрафикПроцентов.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаПроцентов Из СтрокиПроцентов Цикл
		ГрафикПроцентов.Удалить(СтрокаПроцентов);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
